chipKIT32/chipKIT-core/pic32/cores/pic32/HardwareSerial.cpp
}

/* Attach the interrupt by storing a function pointer in the rxIntr variable */
void HardwareSerial::attachInterrupt(void (*callback)(int)) {
    rxIntr = callback;
}

/* Detatching the interrupt is as simple as setting the rxIntr to null. */
void HardwareSerial::detachInterrupt() {
    rxIntr = NULL;
}

/* Sets the bit in the UART status register that enables address detection */
void HardwareSerial::enableAddressDetection(void) {
    uart->uxSta.set = 1 << _UARTSTA_ADDEN;
}

/* Clears the bit in the UART status register that enables address detection */
void HardwareSerial::disableAddressDetection(void) {
    uart->uxSta.clr = 1 << _UARTSTA_ADDEN;
}

/* ------------------------------------------------------------ */
/*				USBSerial Object Class Implementation			*/
/* ------------------------------------------------------------ */


//*******************************************************************************************

#if defined(_USB)

USBSerial::USBSerial(void)
{
	_port = 0;
}
USBSerial::USBSerial(int port)
{
	_port = port;
}

USBSerial::operator int() {
	return Harmony_Cdc_IsPortActive(_port);
}

#ifdef _DEBUG_USB_VIA_SERIAL0_
	#define	DebugViaSerial0(x)	Serial0.println(x)
#else
	#define	DebugViaSerial0(x)
#endif

//*******************************************************************************************
void USBSerial::begin(unsigned long baudRate)
{
}


//*******************************************************************************************
void USBSerial::end()
{
}

//*******************************************************************************************

unsigned long USBSerial::getBaudRate() 
{
	USB_CDC_LINE_CODING *line_coding = Harmony_Cdc_GetLineEncoding(_port);
	if (line_coding == NULL) return 9600;
	return line_coding->dwDTERate;
}

//*******************************************************************************************
int USBSerial::available(void)
{
	return Harmony_Cdc_CanRead(_port);
}

//*******************************************************************************************
int USBSerial::peek()
{
	return Harmony_Cdc_PeekChar(_port);
}

//*******************************************************************************************
int USBSerial::read(void)
{
	return Harmony_Cdc_ReadChar(_port);
}

//*******************************************************************************************
void USBSerial::flush()
{
	Harmony_Cdc_Flush(_port);
}

//*******************************************************************************************
size_t USBSerial::write(uint8_t theChar)
{
	unsigned char	usbBuf[4];
	usbBuf[0]	=	theChar;

	return write(usbBuf, 1);
}

//*******************************************************************************************
size_t USBSerial::write(const uint8_t *buffer, size_t size)
{
	size_t totalBytesWritten = 0;
	size_t bytesWritten = 0;
	size_t zeroWrites = 0;
	CDC_STATUS status;
	while ((size - totalBytesWritten) > 0 && Harmony_Cdc_IsPortActive(_port))
	{
		status = Harmony_Cdc_Write(_port, &buffer[totalBytesWritten], size, &bytesWritten);
		if (bytesWritten == 0)
		{
			if (zeroWrites++ > USB_CDC_INACTIVE_TIMEOUT_MS)
			{
				Harmony_Cdc_SetPortActive(_port, false);
				return totalBytesWritten;
			}

			delay(1);
		}
		else
		{
			totalBytesWritten += bytesWritten;
			zeroWrites = 0;
		}
	}

	return totalBytesWritten;
}

//*******************************************************************************************
size_t USBSerial::write(const char *str)
{
	size_t size;

	size	=	strlen(str);
	write((const uint8_t *)str, size);
    return size;
}


#endif		//	defined(_USB)



/* ------------------------------------------------------------ */
/*			UART Interrupt Service Routines						*/
/* ------------------------------------------------------------ */

//*	we need the extern C so that the interrupt handler names don't
//* get mangled by C++

extern "C" {

/* ------------------------------------------------------------ */
/***	IntSer0Handler
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Interrupt service routine for the UART being used by
**		serial port 0.
*/
#if defined(_SER0_VECTOR)

#if defined(__PIC32MZXX__)
void __attribute__((nomips16,at_vector(_SER0_VECTOR),interrupt(_SER0_IPL_ISR))) IntSer0Handler(void)
#else
void __attribute__((interrupt(), nomips16)) IntSer0Handler(void)
#endif
{
#if defined(_USB) && defined(_USE_USB_FOR_SERIAL_)
	Serial0.doSerialInt();
#else
	Serial.doSerialInt();
#endif
}
#endif

/* ------------------------------------------------------------ */
/***	IntSer1Handler
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Interrupt service routine for the UART being used by
**		serial port 1.
*/
#if defined(_SER1_VECTOR)

#if defined(__PIC32MZXX__)
void __attribute__((nomips16,at_vector(_SER1_VECTOR),interrupt(_SER1_IPL_ISR))) IntSer1Handler(void)
#else
void __attribute__((interrupt(), nomips16)) IntSer1Handler(void)
#endif
{
	Serial1.doSerialInt();
}
#endif

/* ------------------------------------------------------------ */
/***	IntSer2Handler
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Interrupt service routine for the UART being used by
**		serial port 2.
*/
#if defined(_SER2_VECTOR)

#if defined(__PIC32MZXX__)
void __attribute__((nomips16,at_vector(_SER2_VECTOR),interrupt(_SER2_IPL_ISR))) IntSer2Handler(void)
#else
void __attribute__((interrupt(), nomips16)) IntSer2Handler(void)
#endif
{
	Serial2.doSerialInt();
}
#endif

/* ------------------------------------------------------------ */
/***	IntSer3Handler
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Interrupt service routine for the UART being used by
**		serial port 3.
*/
#if defined(_SER3_VECTOR)

#if defined(__PIC32MZXX__)
void __attribute__((nomips16,at_vector(_SER3_VECTOR),interrupt(_SER3_IPL_ISR))) IntSer3Handler(void)
#else
void __attribute__((interrupt(), nomips16)) IntSer3Handler(void)
#endif
{
	Serial3.doSerialInt();
}
#endif

